       PROGRAM-ID.  P2.
       WORKING-STORAGE SECTION.
           01  TEXT2                pic x(9) value "text2".
           01  TEXT3                pic x(9).

       PROCEDURE DIVISION.
       MAIN-LOGIC.
           DISPLAY  TEXT2.


